In [1]:
import pandas as pd
import numpy as np

In [7]:
s=pd.Series([1,2,3,5,6,8],index=['a','v','h','r','d','r'])

In [8]:
#idex1
s['a']

1

In [9]:
s['a':'d']

a    1
v    2
h    3
r    5
d    6
dtype: int64

In [10]:
s[0]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_13912\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

1

In [11]:
s[1:8]

v    2
h    3
r    5
d    6
r    8
dtype: int64

In [12]:
s[1:3]

v    2
h    3
dtype: int64

In [13]:
s[['v','a','h']]

v    2
a    1
h    3
dtype: int64

In [ ]:
veg=pd.Series

1.Position and label based indexing loc/iloc
2.shape function
3.isin(index)
4.missing value-isnull
5.sort index and value
7.unique()/nunique()/value_counts()
6.duplicate value/dropped duplicate
4.t1.index
5.t1.values
6.bolean values veg>2
7.head/tail

In [14]:
#new Series
veg=pd.Series({'Potato':2,'chilli':5,'Tomato':3,'Onion':9,'Ginger':1,'Garlic':10,'cauliflower':4})

In [15]:
veg

Potato          2
chilli          5
Tomato          3
Onion           9
Ginger          1
Garlic         10
cauliflower     4
dtype: int64

In [18]:
veg.values

array([ 2,  5,  3,  9,  1, 10,  4], dtype=int64)

In [19]:
veg.index

Index(['Potato', 'chilli', 'Tomato', 'Onion', 'Ginger', 'Garlic',
       'cauliflower'],
      dtype='object')

In [20]:
veg.shape

(7,)

In [21]:
veg[0]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_13912\643704909.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  veg[0]

2

In [23]:
veg['Potato':'Ginger']

Potato    2
chilli    5
Tomato    3
Onion     9
Ginger    1
dtype: int64

In [24]:
veg[::2]

Potato         2
Tomato         3
Ginger         1
cauliflower    4
dtype: int64

In [ ]:
#loc--label based indexing
veg.loc([])

In [25]:
veg.loc['Potato':'Ginger']

Potato    2
chilli    5
Tomato    3
Onion     9
Ginger    1
dtype: int64

In [27]:
#iloc position based
veg.iloc[2:10]

Tomato          3
Onion           9
Ginger          1
Garlic         10
cauliflower     4
dtype: int64

In [78]:
new=pd.read_csv("C:\customers-100.csv")
new

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [79]:
new.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [80]:
new.iloc[10:20]

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
10,11,216E205d6eBb815,Carl,Schroeder,"Oconnell, Meza and Everett",Shannonville,Guernsey,637-854-0256x825,114.336.0784x788,kirksalas@webb.com,2021-10-20,https://simmons-hurley.com/
11,12,CEDec94deE6d69B,Jenna,Dodson,"Hoffman, Reed and Mcclain",East Andrea,Vietnam,(041)737-3846,+1-556-888-3485x42608,mark42@robbins.com,2020-11-29,http://www.douglas.net/
12,13,e35426EbDEceaFF,Tracey,Mata,Graham-Francis,South Joannamouth,Togo,001-949-844-8787,(855)713-8773,alex56@walls.org,2021-12-02,http://www.beck.com/
13,14,A08A8aF8BE9FaD4,Kristine,Cox,Carpenter-Cook,Jodyberg,Sri Lanka,786-284-3358x62152,+1-315-627-1796x8074,holdenmiranda@clarke.com,2021-02-08,https://www.brandt.com/
14,15,6fEaA1b7cab7B6C,Faith,Lutz,Carter-Hancock,Burchbury,Singapore,(781)861-7180x8306,207-185-3665,cassieparrish@blevins-chapman.net,2022-01-26,http://stevenson.org/
15,16,8cad0b4CBceaeec,Miranda,Beasley,Singleton and Sons,Desireeshire,Oman,540.085.3135x185,+1-600-462-6432x21881,vduncan@parks-hardy.com,2022-04-12,http://acosta.org/
16,17,a5DC21AE3a21eaA,Caroline,Foley,Winters-Mendoza,West Adriennestad,Western Sahara,936.222.4746x9924,001-469-948-6341x359,holtgwendolyn@watson-davenport.com,2021-03-10,http://www.benson-roth.com/
17,18,F8Aa9d6DfcBeeF8,Greg,Mata,Valentine LLC,Lake Leslie,Mozambique,(701)087-2415,(195)156-1861x26241,jaredjuarez@carroll.org,2022-03-26,http://pitts-cherry.com/
18,19,F160f5Db3EfE973,Clifford,Jacobson,Simon LLC,Harmonview,South Georgia and the South Sandwich Islands,001-151-330-3524x0469,(748)477-7174,joseph26@jacobson.com,2020-09-24,https://mcconnell.com/
19,20,0F60FF3DdCd7aB0,Joanna,Kirk,Mays-Mccormick,Jamesshire,French Polynesia,(266)131-7001x711,(283)312-5579x11543,tuckerangie@salazar.net,2021-09-24,https://www.camacho.net/

In [81]:
new.values

array([[1, 'DD37Cf93aecA6Dc', 'Sheryl', ..., 'zunigavanessa@smith.info',
        '2020-08-24', 'http://www.stephenson.com/'],
       [2, '1Ef7b82A4CAAD10', 'Preston', ..., 'vmata@colon.com',
        '2021-04-23', 'http://www.hobbs.com/'],
       [3, '6F94879bDAfE5a6', 'Roy', ..., 'beckycarr@hogan.com',
        '2020-03-25', 'http://www.lawrence.com/'],
       ...,
       [98, '28CDbC0dFe4b1Db', 'Fred', ..., 'swagner@kane.org',
        '2021-09-18', 'https://www.ross.com/'],
       [99, 'c23d1D9EE8DEB0A', 'Yvonne', ...,
        'mccarthystephen@horn-green.biz', '2021-08-11',
        'http://watkins.info/'],
       [100, '2354a0E336A91A1', 'Clarence', ...,
        'colleen91@faulkner.biz', '2020-03-11',
        'http://www.hatfield-saunders.net/']], dtype=object)

In [82]:
new.index

RangeIndex(start=0, stop=100, step=1)

In [83]:
new.columns

Index(['Index', 'Customer Id', 'First Name', 'Last Name', 'Company', 'City',
       'Country', 'Phone 1', 'Phone 2', 'Email', 'Subscription Date',
       'Website'],
      dtype='object')

In [97]:
new['age']=''
new

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website,age
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/,
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/,
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/,
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/,
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/,
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/,
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/,
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/,
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/,

In [102]:
new['Email']='anjalisoni10023@gmail.com'

In [105]:
new1=new.append(pd.Series(),index_name=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [106]:
new['Email'].str.replace('anjalisoni10023@gmail.com','mitali')

0     mitali
1     mitali
2     mitali
3     mitali
4     mitali
       ...
95    mitali
96    mitali
97    mitali
98    mitali
99    mitali
Name: Email, Length: 100, dtype: object

In [108]:
new1=new.drop('Email',axis=1,inplace=False)

In [109]:
len(new1)

100

In [110]:
new.count()

Index                100
Customer Id          100
First Name           100
Last Name            100
Company              100
City                 100
Country              100
Phone 1              100
Phone 2              100
Email                100
Subscription Date    100
Website              100
age                  100
dtype: int64

In [111]:
import pandas as pd

df = pd.read_csv('C:\data.csv')

df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [112]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [113]:
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [114]:
df.iloc[20:35]

    Duration  Pulse  Maxpulse  Calories
20        60    108       131     364.2
21        45    100       119     282.0
22        60    130       101     300.0
23        45    105       132     246.0
24        60    102       126     334.5
25        60    100       120     250.0
26        60     92       118     241.0
27        60    103       132       NaN
28        60    100       132     280.0
29        60    102       129     380.3
30        60     92       115     243.0
31        45     90       112     180.1
32        60    101       124     299.0
33        60     93       113     223.0
34        60    107       136     361.0

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [116]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [117]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [118]:
df.groupby(['Duration']).size()

Duration
15      2
20      9
25      1
30     16
45     35
60     79
75      2
80      1
90      8
120     3
150     4
160     2
180     3
210     2
270     1
300     1
dtype: int64

In [120]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [123]:
df.set_index('origin',inplace=True)
df

KeyError: "None of ['origin'] are in the columns"

In [122]:
import pandas as pd
import numpy as np
listings = pd.read_csv("https://storage.googleapis.com/public-data-337819/listings%202%20reduced.csv",low_memory=False)
# reviews = pd.read_csv("https://storage.googleapis.com/public-data-337819/reviews%202%20reduced.csv",low_memory=False)

In [124]:
listings

,id,listing_url,scrape_id,last_scraped,source,name,description,neighborhood_overview,picture_url,host_id,...,review_scores_communication,review_scores_location,review_scores_value,license,instant_bookable,calculated_host_listings_count,calculated_host_listings_count_entire_homes,calculated_host_listings_count_private_rooms,calculated_host_listings_count_shared_rooms,reviews_per_month
0,92644,https://www.airbnb.com/rooms/92644,20230906022807,2023-09-06,city scrape,Rental unit in Earlsfield · ★4.57 · 1 bedroom ...,<b>The space</b><br />Hi everyone! I have 2 ro...,NaN,https://a0.muscache.com/pictures/715127/85bdb4...,498201,...,4.67,4.53,4.68,NaN,t,1,0,1,0,1.45
1,93015,https://www.airbnb.com/rooms/93015,20230906022807,2023-09-06,city scrape,Rental unit in Hammersmith · ★4.82 · 2 bedroom...,Gorgeous 2 bed ground floor apartment with per...,A bit of history about the W14 area: <br />Com...,https://a0.muscache.com/pictures/865937ec-ee56...,499704,...,4.88,4.85,4.74,NaN,f,1,1,0,0,0.27
2,13913,https://www.airbnb.com/rooms/13913,20230906022807,2023-09-06,city scrape,Rental unit in Islington · ★4.80 · 1 bedroom ·...,My bright double bedroom with a large window h...,Finsbury Park is a friendly melting pot commun...,https://a0.muscache.com/pictures/miso/Hosting-...,54730,...,4.82,4.69,4.69,NaN,f,2,1,1,0,0.26
3,15400,https://www.airbnb.com/rooms/15400,20230906022807,2023-09-06,city scrape,Rental unit in London · ★4.80 · 1 bedroom · 1 ...,Lots of windows and light. St Luke's Gardens ...,It is Chelsea.,https://a0.muscache.com/pictures/428392/462d26...,60302,...,4.83,4.93,4.74,NaN,f,1,1,0,0,0.56
4,93734,https://www.airbnb.com/rooms/93734,20230906022807,2023-09-07,city scrape,Condo in London · ★4.62 · 1 bedroom · 1 bed · ...,<b>During your stay</b><br />I’m a professiona...,NaN,https://a0.muscache.com/pictures/miso/Hosting-...,497514,...,4.81,4.64,4.67,NaN,f,1,0,1,0,1.21
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
87941,973781286754517228,https://www.airbnb.com/rooms/973781286754517228,20230906022807,2023-09-06,city scrape,Rental unit in Greater London · ★New · 1 bedro...,Enjoy a Experience unique look in the center o...,NaN,https://a0.muscache.com/pictures/miso/Hosting-...,498408783,...,NaN,NaN,NaN,NaN,f,2,2,0,0,NaN
87942,973801695874775338,https://www.airbnb.com/rooms/973801695874775338,20230906022807,2023-09-07,city scrape,Rental unit in Greater London · ★New · 1 bedro...,La Casita is a unique one bedroom flat in Sout...,NaN,https://a0.muscache.com/pictures/miso/Hosting-...,36645347,...,NaN,NaN,NaN,NaN,f,1,1,0,0,NaN
87943,973811685656289740,https://www.airbnb.com/rooms/973811685656289740,20230906022807,2023-09-06,city scrape,Home in Greater London · ★New · 1 bedroom · 5 ...,NaN,NaN,https://a0.muscache.com/pictures/hosting/Hosti...,340514057,...,NaN,NaN,NaN,NaN,f,1,0,1,0,NaN
87944,973882998775927897,https://www.airbnb.com/rooms/973882998775927897,20230906022807,2023-09-06,city scrape,Home in Greater London · ★New · 5 bedrooms · 5...,<b>The space</b><br />Looking for a spacious h...,NaN,https://a0.muscache.com/pictures/prohost-api/H...,439074505,...,NaN,NaN,NaN,NaN,t,170,170,0,0,NaN
87945,973895808066047620,https://www.airbnb.com/rooms/973895808066047620,20230906022807,2023-09-06,city scrape,Rental unit in Greater London · ★New · 2 bedro...,Enjoy staying in the heart of London’s Holborn...,About the Holborn London Location:<br />The Ho...,https://a0.muscache.com/pictures/prohost-api/H...,475112423,...,NaN,NaN,NaN,NaN,f,6,6,0,0,NaN

In [126]:
listings.loc[:,['listing_url','name']]

,listing_url,name
0,https://www.airbnb.com/rooms/92644,Rental unit in Earlsfield · ★4.57 · 1 bedroom ...
1,https://www.airbnb.com/rooms/93015,Rental unit in Hammersmith · ★4.82 · 2 bedroom...
2,https://www.airbnb.com/rooms/13913,Rental unit in Islington · ★4.80 · 1 bedroom ·...
3,https://www.airbnb.com/rooms/15400,Rental unit in London · ★4.80 · 1 bedroom · 1 ...
4,https://www.airbnb.com/rooms/93734,Condo in London · ★4.62 · 1 bedroom · 1 bed · ...
...,...,...
87941,https://www.airbnb.com/rooms/973781286754517228,Rental unit in Greater London · ★New · 1 bedro...
87942,https://www.airbnb.com/rooms/973801695874775338,Rental unit in Greater London · ★New · 1 bedro...
87943,https://www.airbnb.com/rooms/973811685656289740,Home in Greater London · ★New · 1 bedroom · 5 ...
87944,https://www.airbnb.com/rooms/973882998775927897,Home in Greater London · ★New · 5 bedrooms · 5...
87945,https://www.airbnb.com/rooms/973895808066047620,Rental unit in Greater London · ★New · 2 bedro...

In [128]:
listings.iloc[2:8,3:7]

,last_scraped,source,name,description
2,2023-09-06,city scrape,Rental unit in Islington · ★4.80 · 1 bedroom ·...,My bright double bedroom with a large window h...
3,2023-09-06,city scrape,Rental unit in London · ★4.80 · 1 bedroom · 1 ...,Lots of windows and light. St Luke's Gardens ...
4,2023-09-07,city scrape,Condo in London · ★4.62 · 1 bedroom · 1 bed · ...,<b>During your stay</b><br />I’m a professiona...
5,2023-09-06,city scrape,Rental unit in London · ★4.76 · 3 bedrooms · 3...,"You'll have a great time in this beautiful, cl..."
6,2023-09-06,city scrape,Rental unit in London · ★4.73 · 2 bedrooms · 3...,"Beautifully presented 2 bedroom, 2 bathroom pe..."
7,2023-09-07,previous scrape,Townhouse in London · ★4.90 · 1 bedroom · 1 be...,"Artist house, bright high ceiling rooms for bo..."

In [100]:
import pandas as pd

print(pd.options.display.max_rows)

60

In [129]:
listings['id']>45677

0         True
1         True
2        False
3        False
4         True
         ...
87941     True
87942     True
87943     True
87944     True
87945     True
Name: id, Length: 87946, dtype: bool

In [135]:
m=listings[['host_is_superhost', 'neighbourhood_cleansed','price']]

In [147]:
# m.groupby('host_is_superhost').size()
listings.groupby("host_is_superhost")['price'].max()

host_is_superhost
f    $999.00
t    $999.00
Name: price, dtype: object

In [155]:
listings.groupby("host_is_superhost")['price'].median

In [29]:
veg[veg>2]

chilli          5
Tomato          3
Onion           9
Garlic         10
cauliflower     4
dtype: int64

In [31]:
veg.head()
veg.tail()

Tomato          3
Onion           9
Ginger          1
Garlic         10
cauliflower     4
dtype: int64

In [33]:
veg.isin([2])

Potato          True
chilli         False
Tomato         False
Onion          False
Ginger         False
Garlic         False
cauliflower    False
dtype: bool

In [36]:
#dealing with duplicate value
new=pd.Series(list('abcd'*4))
new

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [ ]:
#pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc=’mean’, fill_value=None, margins=False, dropna=True, margins_name=’All’)

In [ ]:
#outliers:An Outlier is a data item/object that deviates significantly from the rest of the (so-called normal) objects. Identifying outliers is important in statistics and data analysis because they can have a significant impact on the results of statistical analyses. The analysis for outlier detection is referred to as outlier mining.
#to detect:
1. ZScore=(x-mean)/std.deviation
2.interquatile:Arange the data in increasing order
2.Calculate first q1 and third quartile q3
q3-q1
find lowe bound q1*1.5

In [37]:
#unique
#nunique
#value_counts
new.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [38]:
new.nunique()

4

In [39]:
new.value_counts()

a    4
b    4
c    4
d    4
Name: count, dtype: int64

In [40]:
new.drop_duplicates()

0    a
1    b
2    c
3    d
dtype: object

In [41]:
veg.sort_values()

Ginger          1
Potato          2
Tomato          3
cauliflower     4
chilli          5
Onion           9
Garlic         10
dtype: int64

In [42]:
veg.sort_index()

Garlic         10
Ginger          1
Onion           9
Potato          2
Tomato          3
cauliflower     4
chilli          5
dtype: int64

In [43]:
veg.isnull()

Potato         False
chilli         False
Tomato         False
Onion          False
Ginger         False
Garlic         False
cauliflower    False
dtype: bool

In [49]:
c=veg.index
c.map(lambda x:len(x))

Index([6, 6, 6, 5, 6, 6, 11], dtype='int64')

In [51]:
#DATAFRAME
df=pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [53]:
data=[['alex',30],['anjali',40],['stuti',56]]
dt4=pd.DataFrame(data,columns=['name','age'])
dt4

     name  age
0    alex   30
1  anjali   40
2   stuti   56

In [54]:
data2={'name':['A','b','c','d'],'age':[20,30,40,50]}
dt3=pd.DataFrame(data2,index=['r1','r2','r3','r4'])
dt3

   name  age
r1    A   20
r2    b   30
r3    c   40
r4    d   50

In [55]:
dt3.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [56]:
dt3.columns

Index(['name', 'age'], dtype='object')

In [57]:
dt4.dtypes

name    object
age      int64
dtype: object

In [58]:
dt3.shape

(4, 2)

In [61]:
dt3.size

8

In [63]:
dt3.head(2)

   name  age
r1    A   20
r2    b   30

In [64]:
dt3.tail()

   name  age
r1    A   20
r2    b   30
r3    c   40
r4    d   50

In [65]:
dt3[1:2]

   name  age
r2    b   30

In [66]:
#another way
dt3.name

r1    A
r2    b
r3    c
r4    d
Name: name, dtype: object

In [69]:
data=np.arange(0,20).reshape(5,4)
data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [71]:
df1=pd.DataFrame(np.arange(0,20).reshape(5,4),index=list('abcde'),columns=list('pqrs'))
df1

    p   q   r   s
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e  16  17  18  19

In [74]:
df1['p':'r']

Empty DataFrame
Columns: [p, q, r, s]
Index: []

In [76]:
df1.loc['a':'d','p':'r']

    p   q   r
a   0   1   2
b   4   5   6
c   8   9  10
d  12  13  14

In [77]:
df1.iloc[1:4,1:3]

    q   r
b   5   6
c   9  10
d  13  14

In [68]:
data=np.arange(0,20).reshape(5,4)

In [9]:
#create dataframe
df=pd.DataFrame(data,index=['Row1','Row2','Row3',
                         'Row4','Row5'],columns=['Cow1','Cow2','Cow3',
                         'Cow4'])

In [10]:
df.head()

      Cow1  Cow2  Cow3  Cow4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [11]:
df.tail()

      Cow1  Cow2  Cow3  Cow4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Cow1    5 non-null      int32
 1   Cow2    5 non-null      int32
 2   Cow3    5 non-null      int32
 3   Cow4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [15]:
df.describe()

            Cow1       Cow2       Cow3       Cow4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [16]:
#indexing
##columnname,rowindex[Loc],rowindex columnindex
df.head()

      Cow1  Cow2  Cow3  Cow4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [17]:
df[['Cow1','Cow2','Cow3']]

      Cow1  Cow2  Cow3
Row1     0     1     2
Row2     4     5     6
Row3     8     9    10
Row4    12    13    14
Row5    16    17    18

In [18]:
#using the row index name
df.loc[['Row3','Row4']]

      Cow1  Cow2  Cow3  Cow4
Row3     8     9    10    11
Row4    12    13    14    15

In [19]:
df.head()

      Cow1  Cow2  Cow3  Cow4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [22]:
df.iloc[2:4,0:3]

      Cow1  Cow2  Cow3
Row3     8     9    10
Row4    12    13    14

In [24]:
df.isnull()

       Cow1   Cow2   Cow3   Cow4
Row1  False  False  False  False
Row2  False  False  False  False
Row3  False  False  False  False
Row4  False  False  False  False
Row5  False  False  False  False